{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "id_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "id_inputs"}, "inbound_nodes": []}, {"name": "time_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "time_inputs"}, "inbound_nodes": []}, {"name": "decoder_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 29], "dtype": "float32", "sparse": false, "name": "decoder_inputs"}, "inbound_nodes": []}, {"name": "id_embedding", "class_name": "Embedding", "config": {"name": "id_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 10, "output_dim": 2, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["id_inputs", 0, 0, {}]]]}, {"name": "time_embedding", "class_name": "Embedding", "config": {"name": "time_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 37, "output_dim": 2, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["time_inputs", 0, 0, {}]]]}, {"name": "encoder_inputs", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 9], "dtype": "float32", "sparse": false, "name": "encoder_inputs"}, "inbound_nodes": []}, {"name": "concat_inputs_id_time", "class_name": "Concatenate", "config": {"name": "concat_inputs_id_time", "trainable": true, "axis": -1}, "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["id_embedding", 0, 0, {}], ["time_embedding", 0, 0, {}]]]}, {"name": "rnn_1", "class_name": "RNN", "config": {"name": "rnn_1", "trainable": true, "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "cell": {"class_name": "StackedRNNCells", "config": {"name": "stacked_rnn_cells_1", "trainable": true, "cells": [{"class_name": "GRUCell", "config": {"name": "gru_cell_1", "trainable": true, "units": 222, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, {"class_name": "GRUCell", "config": {"name": "gru_cell_2", "trainable": true, "units": 222, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}]}}}, "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"name": "rnn_2", "class_name": "RNN", "config": {"name": "rnn_2", "trainable": true, "return_sequences": true, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "cell": {"class_name": "StackedRNNCells", "config": {"name": "stacked_rnn_cells_2", "trainable": true, "cells": [{"class_name": "GRUCell", "config": {"name": "gru_cell_3", "trainable": true, "units": 222, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}, {"class_name": "GRUCell", "config": {"name": "gru_cell_4", "trainable": true, "units": 222, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}}]}}}, "inbound_nodes": [[["concat_inputs_id_time", 0, 0, {}], ["rnn_1", 0, 1, {}], ["rnn_1", 0, 2, {}]]]}, {"name": "output_mean", "class_name": "Dense", "config": {"name": "output_mean", "trainable": true, "units": 3, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["rnn_2", 0, 0, {}]]]}, {"name": "output_variance", "class_name": "Dense", "config": {"name": "output_variance", "trainable": true, "units": 3, "activation": "softplus", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["rnn_2", 0, 0, {}]]]}, {"name": "output_mve", "class_name": "Concatenate", "config": {"name": "output_mve", "trainable": true, "axis": -1}, "inbound_nodes": [[["output_mean", 0, 0, {}], ["output_variance", 0, 0, {}]]]}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0], ["id_inputs", 0, 0], ["time_inputs", 0, 0]], "output_layers": [["output_mve", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}